Revit 2024 API
ParameterTypeId.LockAlignmentUiToggle Property
 "Lock": This is used by the UI to allow selection of lock alignment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId LockAlignmentUiToggle { get; }
Visual Basic
Public Shared ReadOnly Property LockAlignmentUiToggle As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ LockAlignmentUiToggle {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace